src/main/resources/bapi/BAPI_GOODSMVT_CREATE_REQUEST_SOAP.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:sap-com:document:sap:rfc:functions">
    <soapenv:Header/>
    <soapenv:Body>
        <urn:BAPI_GOODSMVT_CREATE>
            <!--You may enter the following 9 items in any order-->
            <GOODSMVT_CODE>
                <!--Optional:-->
                <GM_CODE>?</GM_CODE>
            </GOODSMVT_CODE>
            <GOODSMVT_HEADER>
                <!--Optional:-->
                <PSTNG_DATE>?</PSTNG_DATE>
                <!--Optional:-->
                <DOC_DATE>?</DOC_DATE>
                <!--Optional:-->
                <REF_DOC_NO>?</REF_DOC_NO>
                <!--Optional:-->
                <BILL_OF_LADING>?</BILL_OF_LADING>
                <!--Optional:-->
                <GR_GI_SLIP_NO>?</GR_GI_SLIP_NO>
                <!--Optional:-->
                <PR_UNAME>?</PR_UNAME>
                <!--Optional:-->
                <HEADER_TXT>?</HEADER_TXT>
                <!--Optional:-->
                <VER_GR_GI_SLIP>?</VER_GR_GI_SLIP>
                <!--Optional:-->
                <VER_GR_GI_SLIPX>?</VER_GR_GI_SLIPX>
                <!--Optional:-->
                <EXT_WMS>?</EXT_WMS>
                <!--Optional:-->
                <REF_DOC_NO_LONG>?</REF_DOC_NO_LONG>
                <!--Optional:-->
                <BILL_OF_LADING_LONG>?</BILL_OF_LADING_LONG>
                <!--Optional:-->
                <BAR_CODE>?</BAR_CODE>
            </GOODSMVT_HEADER>
            <!--Optional:-->
            <GOODSMVT_REF_EWM>
                <!--Optional:-->
                <REF_DOC_EWM>?</REF_DOC_EWM>
                <!--Optional:-->
                <LOGSYS>?</LOGSYS>
                <!--Optional:-->
                <GTS_SCRAP_NO>?</GTS_SCRAP_NO>
            </GOODSMVT_REF_EWM>
            <!--Optional:-->
            <TESTRUN>?</TESTRUN>
            <!--Optional:-->
            <EXTENSIONIN>
                <!--Zero or more repetitions:-->
                <item>
                    <!--Optional:-->
                    <STRUCTURE>?</STRUCTURE>
                    <!--Optional:-->
                    <VALUEPART1>?</VALUEPART1>
                    <!--Optional:-->
                    <VALUEPART2>?</VALUEPART2>
                    <!--Optional:-->
                    <VALUEPART3>?</VALUEPART3>
                    <!--Optional:-->
                    <VALUEPART4>?</VALUEPART4>
                </item>
            </EXTENSIONIN>
            <GOODSMVT_ITEM>
                <!--Zero or more repetitions:-->
                <item>
                    <!--Optional:-->
                    <MATERIAL>?</MATERIAL>
                    <!--Optional:-->
                    <PLANT>?</PLANT>
                    <!--Optional:-->
                    <STGE_LOC>?</STGE_LOC>
                    <!--Optional:-->
                    <BATCH>?</BATCH>
                    <!--Optional:-->
                    <MOVE_TYPE>?</MOVE_TYPE>
                    <!--Optional:-->
                    <STCK_TYPE>?</STCK_TYPE>
                    <!--Optional:-->
                    <SPEC_STOCK>?</SPEC_STOCK>
                    <!--Optional:-->
                    <VENDOR>?</VENDOR>
                    <!--Optional:-->
                    <CUSTOMER>?</CUSTOMER>
                    <!--Optional:-->
                    <SALES_ORD>?</SALES_ORD>
                    <!--Optional:-->
                    <S_ORD_ITEM>?</S_ORD_ITEM>
                    <!--Optional:-->
                    <SCHED_LINE>?</SCHED_LINE>
                    <!--Optional:-->
                    <VAL_TYPE>?</VAL_TYPE>
                    <!--Optional:-->
                    <ENTRY_QNT>?</ENTRY_QNT>
                    <!--Optional:-->
                    <ENTRY_UOM>?</ENTRY_UOM>
                    <!--Optional:-->
                    <ENTRY_UOM_ISO>?</ENTRY_UOM_ISO>
                    <!--Optional:-->
                    <PO_PR_QNT>?</PO_PR_QNT>
                    <!--Optional:-->
                    <ORDERPR_UN>?</ORDERPR_UN>
                    <!--Optional:-->
                    <ORDERPR_UN_ISO>?</ORDERPR_UN_ISO>
                    <!--Optional:-->
                    <PO_NUMBER>?</PO_NUMBER>
                    <!--Optional:-->
                    <PO_ITEM>?</PO_ITEM>
                    <!--Optional:-->
                    <SHIPPING>?</SHIPPING>
                    <!--Optional:-->
                    <COMP_SHIP>?</COMP_SHIP>
                    <!--Optional:-->
                    <NO_MORE_GR>?</NO_MORE_GR>
                    <!--Optional:-->
                    <ITEM_TEXT>?</ITEM_TEXT>
                    <!--Optional:-->
                    <GR_RCPT>?</GR_RCPT>
                    <!--Optional:-->
                    <UNLOAD_PT>?</UNLOAD_PT>
                    <!--Optional:-->
                    <COSTCENTER>?</COSTCENTER>
                    <!--Optional:-->
                    <ORDERID>?</ORDERID>
                    <!--Optional:-->
                    <ORDER_ITNO>?</ORDER_ITNO>
                    <!--Optional:-->
                    <CALC_MOTIVE>?</CALC_MOTIVE>
                    <!--Optional:-->
                    <ASSET_NO>?</ASSET_NO>
                    <!--Optional:-->
                    <SUB_NUMBER>?</SUB_NUMBER>
                    <!--Optional:-->
                    <RESERV_NO>?</RESERV_NO>
                    <!--Optional:-->
                    <RES_ITEM>?</RES_ITEM>
                    <!--Optional:-->
                    <RES_TYPE>?</RES_TYPE>
                    <!--Optional:-->
                    <WITHDRAWN>?</WITHDRAWN>
                    <!--Optional:-->
                    <MOVE_MAT>?</MOVE_MAT>
                    <!--Optional:-->
                    <MOVE_PLANT>?</MOVE_PLANT>
                    <!--Optional:-->
                    <MOVE_STLOC>?</MOVE_STLOC>
                    <!--Optional:-->
                    <MOVE_BATCH>?</MOVE_BATCH>
                    <!--Optional:-->
                    <MOVE_VAL_TYPE>?</MOVE_VAL_TYPE>
                    <!--Optional:-->
                    <MVT_IND>?</MVT_IND>
                    <!--Optional:-->
                    <MOVE_REAS>?</MOVE_REAS>
                    <!--Optional:-->
                    <RL_EST_KEY>?</RL_EST_KEY>
                    <!--Optional:-->
                    <REF_DATE>?</REF_DATE>
                    <!--Optional:-->
                    <COST_OBJ>?</COST_OBJ>
                    <!--Optional:-->
                    <PROFIT_SEGM_NO>?</PROFIT_SEGM_NO>
                    <!--Optional:-->
                    <PROFIT_CTR>?</PROFIT_CTR>
                    <!--Optional:-->
                    <WBS_ELEM>?</WBS_ELEM>
                    <!--Optional:-->
                    <NETWORK>?</NETWORK>
                    <!--Optional:-->
                    <ACTIVITY>?</ACTIVITY>
                    <!--Optional:-->
                    <PART_ACCT>?</PART_ACCT>
                    <!--Optional:-->
                    <AMOUNT_LC>?</AMOUNT_LC>
                    <!--Optional:-->
                    <AMOUNT_SV>?</AMOUNT_SV>
                    <!--Optional:-->
                    <REF_DOC_YR>?</REF_DOC_YR>
                    <!--Optional:-->
                    <REF_DOC>?</REF_DOC>
                    <!--Optional:-->
                    <REF_DOC_IT>?</REF_DOC_IT>
                    <!--Optional:-->
                    <EXPIRYDATE>?</EXPIRYDATE>
                    <!--Optional:-->
                    <PROD_DATE>?</PROD_DATE>
                    <!--Optional:-->
                    <FUND>?</FUND>
                    <!--Optional:-->
                    <FUNDS_CTR>?</FUNDS_CTR>
                    <!--Optional:-->
                    <CMMT_ITEM>?</CMMT_ITEM>
                    <!--Optional:-->
                    <VAL_SALES_ORD>?</VAL_SALES_ORD>
                    <!--Optional:-->
                    <VAL_S_ORD_ITEM>?</VAL_S_ORD_ITEM>
                    <!--Optional:-->
                    <VAL_WBS_ELEM>?</VAL_WBS_ELEM>
                    <!--Optional:-->
                    <GL_ACCOUNT>?</GL_ACCOUNT>
                    <!--Optional:-->
                    <IND_PROPOSE_QUANX>?</IND_PROPOSE_QUANX>
                    <!--Optional:-->
                    <XSTOB>?</XSTOB>
                    <!--Optional:-->
                    <EAN_UPC>?</EAN_UPC>
                    <!--Optional:-->
                    <DELIV_NUMB_TO_SEARCH>?</DELIV_NUMB_TO_SEARCH>
                    <!--Optional:-->
                    <DELIV_ITEM_TO_SEARCH>?</DELIV_ITEM_TO_SEARCH>
                    <!--Optional:-->
                    <SERIALNO_AUTO_NUMBERASSIGNMENT>?</SERIALNO_AUTO_NUMBERASSIGNMENT>
                    <!--Optional:-->
                    <VENDRBATCH>?</VENDRBATCH>
                    <!--Optional:-->
                    <STGE_TYPE>?</STGE_TYPE>
                    <!--Optional:-->
                    <STGE_BIN>?</STGE_BIN>
                    <!--Optional:-->
                    <SU_PL_STCK_1>?</SU_PL_STCK_1>
                    <!--Optional:-->
                    <ST_UN_QTYY_1>?</ST_UN_QTYY_1>
                    <!--Optional:-->
                    <ST_UN_QTYY_1_ISO>?</ST_UN_QTYY_1_ISO>
                    <!--Optional:-->
                    <UNITTYPE_1>?</UNITTYPE_1>
                    <!--Optional:-->
                    <SU_PL_STCK_2>?</SU_PL_STCK_2>
                    <!--Optional:-->
                    <ST_UN_QTYY_2>?</ST_UN_QTYY_2>
                    <!--Optional:-->
                    <ST_UN_QTYY_2_ISO>?</ST_UN_QTYY_2_ISO>
                    <!--Optional:-->
                    <UNITTYPE_2>?</UNITTYPE_2>
                    <!--Optional:-->
                    <STGE_TYPE_PC>?</STGE_TYPE_PC>
                    <!--Optional:-->
                    <STGE_BIN_PC>?</STGE_BIN_PC>
                    <!--Optional:-->
                    <NO_PST_CHGNT>?</NO_PST_CHGNT>
                    <!--Optional:-->
                    <GR_NUMBER>?</GR_NUMBER>
                    <!--Optional:-->
                    <STGE_TYPE_ST>?</STGE_TYPE_ST>
                    <!--Optional:-->
                    <STGE_BIN_ST>?</STGE_BIN_ST>
                    <!--Optional:-->
                    <MATDOC_TR_CANCEL>?</MATDOC_TR_CANCEL>
                    <!--Optional:-->
                    <MATITEM_TR_CANCEL>?</MATITEM_TR_CANCEL>
                    <!--Optional:-->
                    <MATYEAR_TR_CANCEL>?</MATYEAR_TR_CANCEL>
                    <!--Optional:-->
                    <NO_TRANSFER_REQ>?</NO_TRANSFER_REQ>
                    <!--Optional:-->
                    <CO_BUSPROC>?</CO_BUSPROC>
                    <!--Optional:-->
                    <ACTTYPE>?</ACTTYPE>
                    <!--Optional:-->
                    <SUPPL_VEND>?</SUPPL_VEND>
                    <!--Optional:-->
                    <MATERIAL_EXTERNAL>?</MATERIAL_EXTERNAL>
                    <!--Optional:-->
                    <MATERIAL_GUID>?</MATERIAL_GUID>
                    <!--Optional:-->
                    <MATERIAL_VERSION>?</MATERIAL_VERSION>
                    <!--Optional:-->
                    <MOVE_MAT_EXTERNAL>?</MOVE_MAT_EXTERNAL>
                    <!--Optional:-->
                    <MOVE_MAT_GUID>?</MOVE_MAT_GUID>
                    <!--Optional:-->
                    <MOVE_MAT_VERSION>?</MOVE_MAT_VERSION>
                    <!--Optional:-->
                    <FUNC_AREA>?</FUNC_AREA>
                    <!--Optional:-->
                    <TR_PART_BA>?</TR_PART_BA>
                    <!--Optional:-->
                    <PAR_COMPCO>?</PAR_COMPCO>
                    <!--Optional:-->
                    <DELIV_NUMB>?</DELIV_NUMB>
                    <!--Optional:-->
                    <DELIV_ITEM>?</DELIV_ITEM>
                    <!--Optional:-->
                    <NB_SLIPS>?</NB_SLIPS>
                    <!--Optional:-->
                    <NB_SLIPSX>?</NB_SLIPSX>
                    <!--Optional:-->
                    <GR_RCPTX>?</GR_RCPTX>
                    <!--Optional:-->
                    <UNLOAD_PTX>?</UNLOAD_PTX>
                    <!--Optional:-->
                    <SPEC_MVMT>?</SPEC_MVMT>
                    <!--Optional:-->
                    <GRANT_NBR>?</GRANT_NBR>
                    <!--Optional:-->
                    <CMMT_ITEM_LONG>?</CMMT_ITEM_LONG>
                    <!--Optional:-->
                    <FUNC_AREA_LONG>?</FUNC_AREA_LONG>
                    <!--Optional:-->
                    <LINE_ID>?</LINE_ID>
                    <!--Optional:-->
                    <PARENT_ID>?</PARENT_ID>
                    <!--Optional:-->
                    <LINE_DEPTH>?</LINE_DEPTH>
                    <!--Optional:-->
                    <QUANTITY>?</QUANTITY>
                    <!--Optional:-->
                    <BASE_UOM>?</BASE_UOM>
                    <!--Optional:-->
                    <LONGNUM>?</LONGNUM>
                    <!--Optional:-->
                    <BUDGET_PERIOD>?</BUDGET_PERIOD>
                    <!--Optional:-->
                    <EARMARKED_NUMBER>?</EARMARKED_NUMBER>
                    <!--Optional:-->
                    <EARMARKED_ITEM>?</EARMARKED_ITEM>
                    <!--Optional:-->
                    <STK_SEGMENT>?</STK_SEGMENT>
                    <!--Optional:-->
                    <MOVE_SEGMENT>?</MOVE_SEGMENT>
                    <!--Optional:-->
                    <MATERIAL_LONG>?</MATERIAL_LONG>
                    <!--Optional:-->
                    <MOVE_MAT_LONG>?</MOVE_MAT_LONG>
                    <!--Optional:-->
                    <STK_SEG_LONG>?</STK_SEG_LONG>
                    <!--Optional:-->
                    <MOV_SEG_LONG>?</MOV_SEG_LONG>
                    <!--Optional:-->
                    <CREATE_DELIVERY>?</CREATE_DELIVERY>
                </item>
            </GOODSMVT_ITEM>
            <!--Optional:-->
            <GOODSMVT_SERIALNUMBER>
                <!--Zero or more repetitions:-->
                <item>
                    <!--Optional:-->
                    <MATDOC_ITM>?</MATDOC_ITM>
                    <!--Optional:-->
                    <SERIALNO>?</SERIALNO>
                    <!--Optional:-->
                    <UII>?</UII>
                </item>
            </GOODSMVT_SERIALNUMBER>
            <!--Optional:-->
            <GOODSMVT_SERV_PART_DATA>
                <!--Zero or more repetitions:-->
                <item>
                    <!--Optional:-->
                    <LINE_ID>?</LINE_ID>
                    <!--Optional:-->
                    <RET_AUTH_NUMBER>?</RET_AUTH_NUMBER>
                    <!--Optional:-->
                    <DELIV_NUMBER>?</DELIV_NUMBER>
                    <!--Optional:-->
                    <DELIV_ITEM>?</DELIV_ITEM>
                    <!--Optional:-->
                    <HU_NUMBER>?</HU_NUMBER>
                    <!--Optional:-->
                    <INSPOUT_GUID>?</INSPOUT_GUID>
                    <!--Optional:-->
                    <EVENT>?</EVENT>
                    <!--Optional:-->
                    <DATE>?</DATE>
                    <!--Optional:-->
                    <TIME>?</TIME>
                    <!--Optional:-->
                    <ZONLO>?</ZONLO>
                    <!--Optional:-->
                    <TIMESTAMP>?</TIMESTAMP>
                    <!--Optional:-->
                    <SCRAP_INDICATOR>?</SCRAP_INDICATOR>
                    <!--Optional:-->
                    <KEEP_QUANTITY>?</KEEP_QUANTITY>
                    <!--Optional:-->
                    <GTS_STOCK_TYPE>?</GTS_STOCK_TYPE>
                    <!--Optional:-->
                    <MOVE_GTS_STOCK_TYPE>?</MOVE_GTS_STOCK_TYPE>
                    <!--Optional:-->
                    <KEEP_QUANTITY_CONVERSION>?</KEEP_QUANTITY_CONVERSION>
                    <!--Optional:-->
                    <ZERO_QUANTITY>?</ZERO_QUANTITY>
                    <!--Optional:-->
                    <NUMERATOR>?</NUMERATOR>
                    <!--Optional:-->
                    <DENOMINATR>?</DENOMINATR>
                    <!--Optional:-->
                    <INSP_DOC_NUMB>?</INSP_DOC_NUMB>
                    <!--Optional:-->
                    <PCHG_TYPE>?</PCHG_TYPE>
                </item>
            </GOODSMVT_SERV_PART_DATA>
            <RETURN>
                <!--Zero or more repetitions:-->
                <item>
                    <!--Optional:-->
                    <TYPE>?</TYPE>
                    <!--Optional:-->
                    <ID>?</ID>
                    <!--Optional:-->
                    <NUMBER>?</NUMBER>
                    <!--Optional:-->
                    <MESSAGE>?</MESSAGE>
                    <!--Optional:-->
                    <LOG_NO>?</LOG_NO>
                    <!--Optional:-->
                    <LOG_MSG_NO>?</LOG_MSG_NO>
                    <!--Optional:-->
                    <MESSAGE_V1>?</MESSAGE_V1>
                    <!--Optional:-->
                    <MESSAGE_V2>?</MESSAGE_V2>
                    <!--Optional:-->
                    <MESSAGE_V3>?</MESSAGE_V3>
                    <!--Optional:-->
                    <MESSAGE_V4>?</MESSAGE_V4>
                    <!--Optional:-->
                    <PARAMETER>?</PARAMETER>
                    <!--Optional:-->
                    <ROW>?</ROW>
                    <!--Optional:-->
                    <FIELD>?</FIELD>
                    <!--Optional:-->
                    <SYSTEM>?</SYSTEM>
                </item>
            </RETURN>
        </urn:BAPI_GOODSMVT_CREATE>
    </soapenv:Body>
</soapenv:Envelope>